#Напишите проверку на то, является ли строка палиндромом. Палиндром — это слово или фраза, которые одинаково читаются слева направо и справа налево.
r=str(input())
a=len(r)
c=list(r)
s=a//2
u=-1
k=0
t=0
for i in range(s):
    if c[k]==c[u]:
        t+=1
    u=u-1
    k=k+1
if t==s:
    print('true')
else:
    print('false')