#Напишите код, который переводит целое число в строку, при том что его можно применить в любой системе счисления.
b=int(input())#строка
c=str(input())#осн с. сч
print(int(b,c))