#Выведите первый и последний элемент списка.
a=str(input())
a=list(a)
print(a[0],a[-1])