#Напишите программу, которая принимает имя файла и выводит его расширение. Если расширение у файла определить невозможно, выбросите исключение.
a=str(input())
a=a.split('.')
print(a[1])