#Напишите программу, которая принимает два списка и выводит все элементы первого, которых нет во втором.
a=[1,2,3,4]
b=[1,2]
sh=0
for i in range(len(a)):
    sh=0
    for j in range(len(b)):
        if a[i] !=b[j]:
            sh+=1
    if sh==len(b):
        print(a[i])