#Напишите программу, которая выводит чётные числа из заданного списка и останавливается, если встречает число 237.
a=[1,2,3,4,5,6,7,8,9,10,237,12,13,14]
for i in range(len(a)):
    if a[i]==237:
        break
    if a[i]%2==0:
        print(a[i])
        
