#Напишите код, который переводит целое число в строку, при том что его можно применить в любой системе счисления.
c=str(input())#строка
b=int(input())#осн с. сч
print(int(c,b))