#Напишите программу для слияния нескольких словарей в один.
b={
    1:6,
    3:8,
    5:4,
    7:2
}
c={
    2:1,
    4:3,
    8:5,
    6:7
}
d={}
for i in b:
    d[i]=b[i]
for i in c:
    d[i]=c[i]
print(d)