a="Цифры являются основой математики и используются для представления чисел. Они имеют десятичную систему, состоящую из цифр от 0 до 9. Каждая цифра имеет свою уникальную позицию или разряд в числе, которая определяет ее значение. Например, в числе 347, цифра 3 находится в разряде сотен, цифра 4 находится в разряде десятков, а цифра 7 находится в разряде единиц."
a=a.split()
print(a)
d=0
k=0
for i in range(0,10):
    for c in range(0,len(a)) :
        if str(i)==a[c] and k!=1:
            d=a[c]
            k=k+1
print(d)